# Итоговая проверочная работа
## Задача : 

 Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

 Пример:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

## Описание алгоритма:

Обьявляем массив, из 5 значений, и предлогаем с консоли вввести 5 значений

 Console.Write(" Ввведите массив из 5 значений ");
 Оьявляем второй массив
 string[] array2 = new string[array1.Length];
  и делаем цикл:

if(array1[i].Length <= 3)
array2[count] = array1[i];
count++;  

если элемент первого массива <= 3, то заносится в count элемент второго массива, если Нет, то i увеличивается на 1 и переходит к следующему значению 
Затем так же методом перебора, при момощи цикла данные через  PrintArray отправляются на консоль

[Блок схему можно посмотреть кликнув сюда ](https://drive.google.com/file/d/1qB9q3M1RoJdoQYDCv5H_PjMGVb7CnTEd/view?usp=sharing)

Программу можно посмотреть в папке Program.cs

